"""  
SQL - Structured Query Language - структурированный язык запросов - язык общения с базами данных

База данных (БД) - организованная структура для хранения больших объемов данных

Системы управления базами данных (СУБД) - программа для управления организацией баз данных (создание. обновления. удаления, получение)

PostgreSQL, Access, MySQL, Oracle, Redis...

Реляционные - имеют связи между таблицами
Нереляционные - не имеют связей (ключ, значение)

PostgreSQL - реляционная СУБД, имеет встроенные функции, открытый исходный код, частые обновления, соответствует стандарты ACID(atomicity - атомарность, consistency - согласованность, isolation - изолированность, durability - стойкость)

Категории запросов:
DDl (Data Definition Language) - работа над таблицами (CREATE, ALTER, DROP)
DML (Data Manipulation Language) - работа с данными в таблицах (SELECT, INSERT, UPDATE, DELETE)
TCL (Transaction Control Language) - работа с транзакциями (COMMIT, ROLLBACK, SAVEPOINT)
"""